*** Solution

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <vector>
  #include <algorithm>
  using namespace std;

  bool isValidPassword(int min, int max, char letter, const string& password) {
      int letterCount = 0;

      for (auto c : password) {
          if (c == letter) {
              ++letterCount;

              if (letterCount > max)
                  return false;
          }
      }

      return min <= letterCount && letterCount <= max;
  }

  int main() {
      ifstream file("input");
      int min;
      int max;
      char ignoredChar;
      char letter;
      string password;

      int validCount = 0;

      while (file >> min >> ignoredChar >> max >> letter >> ignoredChar >> password) {
          // cout << min << " " << max << " " << letter << " " << password << " ";

          if(isValidPassword(min, max, letter, password)) {
              // cout << "valid\n";
              ++validCount;
          } else {
              // cout << "invalid\n";
          }
      }

      file.close();
      cout << validCount << "\n";
  }
#+end_src

#+RESULTS:
: 660

*** Solution

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++11 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <vector>
  #include <algorithm>
  using namespace std;

  bool isValidPassword(int i, int j, char letter, const string& password) {
      return (password[i-1] == letter && password[j-1] != letter) ||
             (password[i-1] != letter && password[j-1] == letter);
  }

  int main() {
      ifstream file("input");
      int i;
      int j;
      char ignoredChar;
      char letter;
      string password;

      int validCount = 0;

      while (file >> i >> ignoredChar >> j >> letter >> ignoredChar >> password) {
          // cout << i << " " << j << " " << letter << " " << password << " ";

          if(isValidPassword(i, j, letter, password)) {
              // cout << "valid\n";
              ++validCount;
          } else {
              // cout << "invalid\n";
          }
      }

      file.close();
      cout << validCount << "\n";
  }
#+end_src

#+RESULTS:
: 530

